DATAFRAMES

-  What is a dataframe? (pandas)
- Create df 
- Vectorized operations 
- Access rows, columns, cells, (.loc, .iloc, ,at)
- Change values 
- Sort values

In [88]:
import pandas as pd 
# panda series is a series of items, a panda data series is a colllection of items
# a data frame (DF) is a collection of series

In [89]:
from typing import List 
data_list: List[int] = [1,2,3,4,5]

s1 = pd.Series(data_list)
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [90]:
s1 = pd.Series(data=data_list, index =['a', 'b', 'c', 'd', 'e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [91]:
s1["a"]

np.int64(1)

In [92]:
s1 = s1 +23 
s1

a    24
b    25
c    26
d    27
e    28
dtype: int64

DF can have: 
- column labels (each series is going to be a column, x-axis)
- index labels (y-axis)

2 ways to create a DF: 
- dictionary creation 
- row-based creation 

Rules: 
- columns need to be homogenous (same data type) (cannot mix strings and numbers, etc. in one column) (all have to be strings, or whatever type)
- every column has to have the same number of data entries (every series must have the same amount)

In [93]:
#DICTIONARY CREATION 

data = {
    'name': ['Paige', 'Alexis', 'Sarah', 'Halle'],
    'age': ['33', '27', '25', '21'],
    'favorite color': ['green', 'orange', 'green', 'blue']
}

students_df = pd.DataFrame(data=data)
students_df = students_df.set_index('name')
students_df #changes index to the name

       age favorite color
name
Paige   33          green
Alexis  27         orange
Sarah   25          green
Halle   21           blue

In [94]:
students_df = students_df.reset_index()
students_df

     name age favorite color
0   Paige  33          green
1  Alexis  27         orange
2   Sarah  25          green
3   Halle  21           blue

In [95]:
#ROW-BASED CREATION

import random 

names = ['Messi', 'Ronaldo', 'Neymar', 'Pulisc', 'Mbappe']
goals_per_game = [random.random() for _ in names]
games = [round(random.random() * 1000) for _ in names] # * 1000, 1) declares how many decimals to round to 
games

cols = ['name', 'goals per game', 'games']
stats = [[names[i], goals_per_game[i], games[i]] for i in range(5)]

stats_df = pd.DataFrame(data=stats, columns=cols) #changes the list of lists into a data frame table 
stats_df

      name  goals per game  games
0    Messi        0.167605    227
1  Ronaldo        0.650316    850
2   Neymar        0.703982    256
3   Pulisc        0.498786    860
4   Mbappe        0.843797    111

In [96]:
stats_df['new column'] = 0 
stats_df

      name  goals per game  games  new column
0    Messi        0.167605    227           0
1  Ronaldo        0.650316    850           0
2   Neymar        0.703982    256           0
3   Pulisc        0.498786    860           0
4   Mbappe        0.843797    111           0

In [97]:
stats_df = stats_df.drop(columns=['new column'])
stats_df

      name  goals per game  games
0    Messi        0.167605    227
1  Ronaldo        0.650316    850
2   Neymar        0.703982    256
3   Pulisc        0.498786    860
4   Mbappe        0.843797    111

In [98]:
stats_df['goals'] = stats_df['goals per game'] * stats_df['games']
stats_df

      name  goals per game  games       goals
0    Messi        0.167605    227   38.046311
1  Ronaldo        0.650316    850  552.768474
2   Neymar        0.703982    256  180.219388
3   Pulisc        0.498786    860  428.955655
4   Mbappe        0.843797    111   93.661414

In [99]:
stats_df = stats_df.rename(columns={'goals per game': 'goals_p_game'})
# stats_df.rename9(columns={'goals per game': 'goals_p_game'}, inplace = True)
stats_df

      name  goals_p_game  games       goals
0    Messi      0.167605    227   38.046311
1  Ronaldo      0.650316    850  552.768474
2   Neymar      0.703982    256  180.219388
3   Pulisc      0.498786    860  428.955655
4   Mbappe      0.843797    111   93.661414

In [100]:
#call the column 
stats_df['games']

0    227
1    850
2    256
3    860
4    111
Name: games, dtype: int64

In [101]:
stats_df['name'] = stats_df['name'].str.lower()
stats_df

      name  goals_p_game  games       goals
0    messi      0.167605    227   38.046311
1  ronaldo      0.650316    850  552.768474
2   neymar      0.703982    256  180.219388
3   pulisc      0.498786    860  428.955655
4   mbappe      0.843797    111   93.661414

In [ ]:
stats_df.loc[1:2, 'name'] # in df, second items after colon is inclusive

1    ronaldo
2     neymar
Name: name, dtype: object

In [118]:
stats_df.loc[:, 'name':'goals']

      name  goals_p_game  games       goals
0    messi      0.167605    227   38.046311
1  ronaldo      0.650316    850  552.768474
2   neymar      0.703982    256  180.219388
3   pulisc      0.498786    860  428.955655
4   mbappe      0.843797    111   93.661414

In [ ]:
# BOOLEAN LOGIC WITH LOC 

stats_df.loc[stats_df['goals_p_game'] > 0.5] #rows go first

      name  goals_p_game  games       goals
1  ronaldo      0.650316    850  552.768474
2   neymar      0.703982    256  180.219388
4   mbappe      0.843797    111   93.661414

In [120]:
stats_df.loc[stats_df['goals_p_game'] > 0.5, 'name']

1    ronaldo
2     neymar
4     mbappe
Name: name, dtype: object

In [121]:
stats_df.loc[stats_df['name'] == 'messi', 'name'] = 'ronaldo'
stats_df.loc[stats_df['goals_p_game'] > 0.5, 'name'] = 'messi'
stats_df

      name  goals_p_game  games       goals
0  ronaldo      0.167605    227   38.046311
1    messi      0.650316    850  552.768474
2    messi      0.703982    256  180.219388
3   pulisc      0.498786    860  428.955655
4    messi      0.843797    111   93.661414

In [3]:
#.iloc, .at, .iat
# pull in data and play 

import pandas as pd

url = "https://raw.githubusercontent.com/nkmwicz/data-for-students/refs/heads/main/french-ambs.csv"
df = pd.read_csv(url)
df.head(10)

   id                      name    place  year    lat   long      lat_long
0   0        Richer, Christophe  Denmark  1543  55.68  12.57  55.68, 12.57
1   1        Richer, Christophe  Denmark  1541  55.68  12.57  55.68, 12.57
2   2        Danzay, Charles de  Denmark  1561  55.68  12.57  55.68, 12.57
3   3        Danzay, Charles de  Denmark  1563  55.68  12.57  55.68, 12.57
4   4        Danzay, Charles de  Denmark  1582  55.68  12.57  55.68, 12.57
5   5        Bapaume, Robert de  England  1516  51.51  -0.12  51.51, -0.12
6   6  Passano, Jean-Joachim de  England  1527  51.51  -0.12  51.51, -0.12
7   7               De Monpreat  England  1532  51.51  -0.12  51.51, -0.12
8   8           Du Bellay, Jean  England  1530  51.51  -0.12  51.51, -0.12
9   9     Castelnau, Antoine de  England  1534  51.51  -0.12  51.51, -0.12